print('hello world')
#функция print нужна для вывода данных в консоли

name = input("скажи свое имя:")
#переменная, которая хранит в себе строку
age = int(input("введите свой возраст:"))
#переменная, которая хранит в себе целочисленное число

water = 4.5
#переменная,которая хранит в себе дробь
print(type(age), type(name))
'''
функция type - нужна для определения 
типа данных наших переменных 
'''
print("привет," , name,'тебе',age,'лет')
print("я пью", water, 'литра водки')
makaka = int(input('5*8:10=?'))
print(' правильный ответ 4, ваш ответ:', makaka)

ishak = int(input('D=B2-4AC'))
#дискриминант


#задание 1
#пользователь вводит с клавиатуры 3 числа необходимо найти сумму чисел
#найти произведение чисел найти разность чисел найти деление
#результат операции вывести на экран
